app/controllers/feeds_controller.rb

SELECT * FROM `languages` WHERE (`languages`.`code` = 'en') LIMIT 1
INSERT INTO `feeds` (`is_blog`, `url`, `publication`, `website`, `id`, `is_opinion`, `language_id`, `source_id`, `is_video`, `subscription_type`) VALUES(1, 'http://www.ggoogle.com/', 'pp', 'www.google.com', 1, 0, 38, 1, 0, 'public')
---
  def create
    return if render_head_ok_if_exists?( Feed, params[:feed][:id] )
    @language = Language.find_by_code(params[:feed][:language_code])
    params[:feed].delete(:language_code)
    params[:feed][:language_id] =  @language.id

    @feed              = Feed.new(params[:feed])
    @feed.id           = params[:feed][:id]

    respond_to do |format|
      if @feed.save