app/controllers/languages_controller.rb

SELECT * FROM `languages`
---
  def index
    @languages = Language.all

SELECT * FROM `languages` WHERE (`languages`.`id` = 185)
---
  def show
    @language = Language.find(params[:id])

SELECT `languages`.id FROM `languages` WHERE (`languages`.`code` = BINARY 'de' AND `languages`.id <> 185) LIMIT 1
---
   def find_by_code
     @language = Language.find_by_code(params[:code])

SELECT * FROM `languages` WHERE (`languages`.`id` = 185)
---
  def edit
    @language = Language.find(params[:id])

INSERT INTO `languages` (`name`, `code`) VALUES('bb', '')
---
  def create
    @language = Language.new(params[:language])

    respond_to do |format|
      if @language.save

SELECT * FROM `languages` WHERE (`languages`.`id` = 185)
UPDATE `languages` SET `code` = 'aalllllllllll' WHERE `id` = 185
---
  def update
    @language = Language.find(params[:id])

    respond_to do |format|
      if @language.update_attributes(params[:language])