app/controllers/regions_controller.rb

  def index
    @regions = Region.all
---
SELECT * FROM `regions`

  def show
    @region = Region.find(params[:id])
---
SELECT * FROM `regions` WHERE (`regions`.`id` = 1)

   def find_by_code
     @region = Region.find_by_code(params[:code])
---
SELECT `regions`.id FROM `regions` WHERE (`regions`.`code` = BINARY 'EU') LIMIT 1

  def create
    @region = Region.new(params[:region])

    respond_to do |format|
      if @region.save
---
INSERT INTO `regions` (`name`, `code`) VALUES('Europe', 'EU')