app/controllers/sources_controller.rb

SELECT * FROM `sources` WHERE (`sources`.`id` = 1)
---
  def show
    @source = Source.find(params[:id])

INSERT INTO `sources` (`name`, `url`, `id`, `subscription_type`) VALUES('New York Times', 'www.nytimes.com', 1, 'public')
---
  def create
    return if render_head_ok_if_exists?( Source, params[:source][:id] )
    @source    = Source.new(params[:source])
    @source.id = params[:source][:id]

    respond_to do |format|
      if @source.save

SELECT * FROM `sources` WHERE (`sources`.`id` = 1)
UPDATE `sources` SET `name` = 'sdfsdfdsf' WHERE `id` = 1
---
  def update
    @source = Source.find(:first, :conditions => { :id => params[:id] })
    unless @source
      create
      return
    end

    respond_to do |format|
      if @source.update_attributes(params[:source])

SELECT * FROM `sources` WHERE (`sources`.`id` = 1)
SELECT * FROM `regions` WHERE (`regions`.`id` = 1)
INSERT INTO `source_regions` (`region_id`, `source_id`) VALUES(1, 1)
SELECT `regions`.id FROM `regions` INNER JOIN `source_regions` ON `regions`.id = `source_regions`.region_id WHERE (`regions`.`id` = 1) AND ((`source_regions`.source_id = 1)) LIMIT 1
---
  def associate_region
    @source = Source.find(params[:id])
    @region = Region.find(params[:region][:id])

    respond_to do |format|
      if @source.regions.include?(@region) or (@source.regions << @region and @source.save)

SELECT * FROM `sources` WHERE (`sources`.`id` = 1)
SELECT * FROM `regions` WHERE (`regions`.`id` = 1)
DELETE FROM `source_regions` WHERE (`source_regions`.`region_id` = 1 AND `source_regions`.`source_id` = 1)
SELECT `regions`.id FROM `regions` INNER JOIN `source_regions` ON `regions`.id = `source_regions`.region_id WHERE (`regions`.`id` = 1) AND ((`source_regions`.source_id = 1)) LIMIT 1
---
  def disassociate_region
    @source = Source.find(params[:id])
    @region = Region.find(params[:region][:id])

    respond_to do |format|
      if not @source.regions.include?(@region) or (@source.regions.delete(@region) and @source.save)